Tekla.Structures.Model.SharingUpdateType
Specifies the type of sharing update used in model sharing operations.
Remarks:
When model is joined to a specific update to a new folder, the latest Tekla.Structures.Model.SharingUpdateType.Baseline update is downloaded fully,
and all the differences from the intermediate updates are applied to that.
When model is already joined and read-in is performed, always only the diffrences from the downloaded udpates
are used, even if some of them are Tekla.Structures.Model.SharingUpdateType.Baseline updates.

Tekla.Structures.Model.SharingUpdateType.Update
Represents an update update.
Remarks:
It contains differences to the previous update.

Tekla.Structures.Model.SharingUpdateType.Baseline
Represents a baseline update.
Remarks:
It contains both the difference to the previous update and the whole model.